"""
7. Напишите программу, доказывающую или проверяющую, что для множества
натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2,
где n - любое натуральное число.
"""


def first(fir):
    if fir == 1:
        return fir
    elif fir > 0:
        return fir + first(fir-1)


def second(sec):
    return sec * (sec + 1) // 2


n = 1

while True:
    if first(n) == second(n):
        print(f'Для n={n} - True')
    else:
        print(f'Для n={n} - False')
        break
    n += 1